<?php
class Err{
    public static $arErrCode = array(
        //1001  --- 1099   以下为服务端错误码
        '0000' => '操作成功',


        '1001' => '签名认证不通过',
        '1002' => '服务器异常',
        '1003' => '参数错误', // 参数错误
        '1004' => '操作文件失败',
        '1005' => '没有更多内容啦', // 没有可操作的数据
        '1006' => '令牌认证失败，请重新登录',
        '1007' => '令牌已过期，请重新登录',
        '1008' => 'mc异常',
        '1009' => 'token参数不能为空，请先登录',
		'1010'	=> '文件上传失败',

		'1097'	=> '请使用正确的请求方式',
		'1098' => '路由错误',
        '1099' => '未知错误',


        // 2001  --- 2099  用户错误
        '2001'  => '用户注册失败',
        '2002'  => '用户注册类型填写失败',
        '2003'  => '手机号格式错误',
        '2004'  => '验证码发送太过频繁',
        '2005'  => '验证码已失效',
        '2006'  => '验证码错误',
        '2007'  => '手机号绑定认证失败',
        '2008'  => '微信小程序openId、session获取凭证失败',
        '2009'  => '其他第三方注册未开发',
		'2010'	 => '用户信息修改失败',



        // 3001  --- 3099  约战错误
        '3001'  => '约战发布失败',
        '3002'  => '未上传游戏截图',
        '3003'  => '上传游戏截图类型错误',
        '3004'  => '约战发布时间冲突',

        //  4001  --- 4099  报名大赛
        '4001'	=> '请填写游戏账号',
        '4002'	=> '请填写游戏昵称',
        '4003'	=> '请填写游戏Level',
        '4004'	=> '请选择游戏区服',
        '4005'	=> '请选择正确的区服ID',
		'4006'	=> '该游戏不是团队赛',
		'4007'	=> '该战队名已存在，请重新输入',
		'4008'	=> '你已有该游戏战队，请退出其它战队',
		'4009'	=> '战队创建失败',
		'4010'	=> '战队名称过长',
		'4011'	=> '请选择正确的赛区',
		'4012'	=> '战队加入失败',
		'4013' => '暂无该战队信息',
		'4014'	=> '战队申请失败',
		'4015'	=> '暂无权限查看申请列表',
		'4016'	=> '战队操作失败',
		'4017'	=> '请选择正确的战队操作类型',
		'4018'	=> '请选择用户',
		'4019'	=> '你没有权限踢出该队员',
		'4020'	=> '队员踢出失败',
		'4021'	=> '队员加入失败',
		'4022'	=> '队员自动退队失败',
 		'4023'	=> '队员忽略失败，请稍后再试',
		'4024'	=> '你没有权限指定副队长',
		'4025'	=> '该战队已有副队长',
		'4026'	=> '副队长指定失败',
		'4027'	=> '你已提交申请，请勿重复提交',
		'4028'	=> '微信access_token获取失败',
		'4029'	=> '二维码获取失败',
		'4030'	=> '战队分享记录插入失败',



		//  5001  --- 5099  Pub公共模块
		'5001'	=> '二维码解析失败',

		//  6001  --- 6099  支付模块



		);


}
